Revit 2024 API
BuiltInFailures.RegenFailures.CircularDependencyAssocPropError Property
 There is a circular dependency between a Line created with Pick Support and the supporting member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularDependencyAssocPropError { get; }
Visual Basic
Public Shared ReadOnly Property CircularDependencyAssocPropError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularDependencyAssocPropError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace